* Tasks
** DONE C++外星人系列图片，视频重新截取
   CLOSED: <2017-01-04 周三 14:30>
   <2017-01-04 周三 10:00>

** DONE C++二校,回应不明之处
   CLOSED: [2017-01-04 周三 14:43] SCHEDULED: <2017-01-04 周三 13:10>
   李丹

** DONE 继续取截取视频
   CLOSED: [2017-01-04 周三 18:02] SCHEDULED: <2017-01-04 周三 14:30>
   第九章没有拆分视频
   
** DONE 休息一下
   CLOSED: [2017-01-05 周四 09:07]

** TODO 学习的工具 [0%]
   SCHEDULED: <2017-01-04 周三 22:55>

*** TODO emacs [33%]
    
**** TODO spacemacs [0%]

***** TODO spacemacs [%]
****** distribution 
        + spacemacs 
          开箱即用
        + spacemacs-base

****** .spacemacs
******* user-init()
         加上镜像的地址,从 emacs china 寻找镜像
       #+BEGIN_SRC lisp
       (setq configuration-layer-elpa-archives '(("melpa-cn" ...
       #+END_SRC
******* space 键弹出的窗口使用的 which-key.el
         + sp f e d  -> .spacemacs 文件
******* ivy C-s 使用 Swiper 进行搜索
******* maxixed 在当前桌面启动时最大化
******* sp h sp 查看插件安完了哪些 Package
         Spacemacs Layers and packages: ivy
******* 可以去除一些包
******* 安装 package
        不可以直接使用 package-install，退出以后，包就不存在了。正确方式是自己添加到.spacemacs->
******* 先把所有的配置放在 user-config 里面


**** TODO org-mode [0%]
***** TODO org-mode 添加任务提醒
      内容请看这个网页
      https://www.cnblogs.com/ibgo/p/4508802.html

**** DONE Emacs 中的日程户理 Entered on <2017-01-06 周五 14:02>
     CLOSED: [2017-01-06 周五 14:10] SCHEDULED: <2017-01-06 周五 14:03>
     :LOGBOOK:
     CLOCK: [2017-01-06 周五 14:03]--[2017-01-06 周五 14:08] =>  0:05
     :END:

     http://blog.csdn.net/lujun9972/article/details/46002855

     
*** TODO git [%]
    
** DONE 出 gong
   CLOSED: [2017-01-05 周四 09:07]
 Entered on <2017-01-05 周四 07:29>
** DONE 取得显示器分辨率
   CLOSED: [2017-01-05 周四 09:07]
 Entered on <2017-01-05 周四 07:38>
 #+BEGIN_SRC lisp
   (car (cdr (cdr (cdr (car (car (display-monitor-attributes-list)))))))
   (cadr (cdr (cdr (cdr (car (car (display-monitor-attributes-list)))))))
 #+END_SRC
** DONE 总结视频拆分内容
   CLOSED: [2017-01-05 周四 11:42]
 Entered on <2017-01-05 周四 08:40>
** DONE 困了，出去休息一下
   CLOSED: [2017-01-05 周四 13:10]
Entered on <2017-01-05 周四 13:03>
** DONE 第 05 章练一练 Entered on <2017-01-05 周四 13:10>
   CLOSED: [2017-01-05 周四 13:36]
** CANCEL 临时去学习 emacs24-starter-kit Entered On <2017-01-05 周四 13:22>
   CLOSED: [2017-01-07 周六 12:29]
** DONE 第 06 章的练一练 Entered on <2017-01-05 周四 13:36>
   CLOSED: [2017-01-05 周四 15:45]
** DONE 第 07 章的练一练 Entered on <2017-01-05 周四 15:45>
   CLOSED: [2017-01-06 周五 17:49]
   :LOGBOOK:
   CLOCK: [2017-01-06 周五 17:20]--[2017-01-06 周五 17:48] =>  0:28
   CLOCK: [2017-01-06 周五 16:53]--[2017-01-06 周五 16:57] =>  0:04
   CLOCK: [2017-01-06 周五 15:58]--[2017-01-06 周五 16:49] =>  0:51
   CLOCK: [2017-01-06 周五 13:06]--[2017-01-06 周五 14:03] =>  0:57
   CLOCK: [2017-01-06 周五 11:00]--[2017-01-06 周五 11:50] =>  0:50
   CLOCK: [2017-01-05 周四 17:17]--[2017-01-05 周四 18:01] =>  0:44
   CLOCK: [2017-01-05 周四 16:33]--[2017-01-05 周四 17:04] =>  0:31
   :END:
** DONE 录制视频片段 1.3.2 增加一个 PPT 简单说几十秒 Entered on <2017-01-05 周四 16:03>
   CLOSED: [2017-01-06 周五 15:57] SCHEDULED: <2017-01-06 周五 10:00>
   :LOGBOOK:
   CLOCK: [2017-01-06 周五 12:50]--[2017-01-06 周五 13:03] =>  0:13
   CLOCK: [2017-01-06 周五 08:33]--[2017-01-06 周五 12:50] =>  4:17
   :END:
** TODO 第 08 章的练一练 Entered on <2017-01-06 周五 17:48>
   :LOGBOOK:
   CLOCK: [2017-01-06 周五 17:49]--[2017-01-06 周五 18:06] =>  0:17
   :END:

